app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "home room"], ["room_number", 1], ["created_at", "2020-12-15 19:30:14.576883"], ["updated_at", "2020-12-15 19:30:14.576883"]]
---
    def create
        @school_class = SchoolClass.new
        @school_class.title = params[:school_class][:title]
        @school_class.room_number = params[:school_class][:room_number]
        @school_class.save